Revit 2027 API
BuiltInFailures.FilledRegionFailures Class
 Failures about FilledRegion.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FilledRegionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FilledRegionFailures
Public NotInheritable Class FilledRegionFailures
public ref class FilledRegionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FilledRegionFailures = class end
The BuiltInFailures.FilledRegionFailures type exposes the following members.
Properties
Name | Description
BadViewType |  [Filled Region Name] can't be placed in 3D Views.
CannotDrawFilledRegion |  Can't draw [Filled Region Name].
CannotDrawFilledRegionError |  Can't draw [Filled Region Name].
Top
See Also
Reference
Autodesk.Revit.DB Namespace